app/views/poops/index.html.erb

  <div class="total-votes-header center-align">
    <h4>Total Shits: <%= Vote.all.count %></h4>
---
SELECT "votes".* FROM "votes" WHERE (created_at > '2016-11-18 00:51:33.480500')
SELECT COUNT(*) FROM "votes" WHERE "votes"."poop_id" = $1  [["poop_id", 2]]