app/controllers/poops_controller.rb

SELECT "poops".* FROM "poops"
---
  def index
    check_for_user
    @vote = Vote.new
    @poops = Poop.all