app/controllers/votes_controller.rb

  def create
    @poop_id = Poop.find_by(desc: params[:desc]).id
    @vote = Vote.new(user_id: session[:user_id], poop_id: @poop_id)
    if @vote.save
---
SELECT  "poops".* FROM "poops" WHERE "poops"."desc" = $1 LIMIT $2  [["desc", "Enjoyable"], ["LIMIT", 1]]
INSERT INTO "votes" ("user_id", "poop_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 24], ["poop_id", 2], ["created_at", 2016-11-18 01:36:54 UTC], ["updated_at", 2016-11-18 01:36:54 UTC]]

  def index
    if request.xhr?
      render json: Poop.all.order(:id).map{ |poo| poo.votes.length }
---
SELECT "poops".* FROM "poops" ORDER BY "poops"."id" ASC
SELECT "votes".* FROM "votes" WHERE "votes"."poop_id" = $1  [["poop_id", 2]]